Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The record protection functions translate a TLSPlaintext structure into a TLSCiphertext structure.
zh_cn: 记录保护功能将 TLSPlaintext 结构转换为 TLSCiphertext 结构。

source: The record protocol divides traffic up into a series of records, each of which is independently protected using the traffic keys.
zh_cn: 记录协议将流量划分为一系列记录，每个记录使用通信密钥独立保护。

source: The reg-name syntax allows percent-encoded octets in order to represent non-ASCII registered names in a uniform way that is independent of the underlying name resolution technology.
zh_cn: reg-name 语法允许百分比编码的八位字节，以便以统一的方式表示非 ASCII 注册名称，独立于基础名称解析技术。

source: The registries and their allocation policies (unchanged from [TLS1.1]) are listed below.
zh_cn: 注册表及其分配策略(与 [TLS1.1] 保持不变)如下所示。

source: The relationship between HTTP and MIME is described in appendix 19.4.
zh_cn: HTTP 和 MIME 之间的关系在附录 19.4 中描述。

source: The relevance of this operator is decreasing as more and more operators now allow setting their buffer sizes.
zh_cn: 随着越来越多的操作符现在允许设置其缓冲区大小，此操作符的相关性正在下降。

source: The relevant parameters are usually called `bufferSize`, `prefetch` or `capacityHint`.
zh_cn: 相关参数通常称为 `bufferSize`，`prefetch` 或 `capacityHint`。

source: The remaining action interfaces were named according to the Java 8 functional types.
zh_cn: 其余的操作接口根据 Java 8 函数类型命名。

source: The remote TCP initiates by sending a FIN control signal
zh_cn: 远程 TCP 通过发送 FIN 控制信号启动

source: The representation data associated with an HTTP message is either provided as the payload body of the message or referred to by the message semantics and the effective request URI.
zh_cn: 与 HTTP 消息相关联的表示数据或者作为消息的有效载荷主体提供，或者由消息语义和有效请求 URI 引用。

source: The representation data is in a format and encoding defined by the representation metadata header fields.
zh_cn: 表示数据采用由表示元数据首部字段定义的格式和编码。

source: The representation of all data items is explicitly specified.
zh_cn: 显式指定了所有数据项的表示形式。

source: The representation of entities in any response can be negotiated (including error responses).
zh_cn: 可以协商任何响应中的实体表示(包括错误响应)。

source: The request method is case-sensitive.
zh_cn: 请求方法区分大小写。

source: The request method token is the primary source of request semantics; it indicates the purpose for which the client has made this request and what is expected by the client as a successful result.
zh_cn: 请求方法标记是请求语义的主要来源；它表示客户提出此请求的目的以及客户期望的成功结果。

source: The request method was envisioned as applying semantics to a target resource in much the same way as invoking a defined method on an identified object would apply semantics.
zh_cn: 请求方法被设想为将语义应用于目标资源，其方式与在已识别的将应用语义的对象上调用已定义方法的方式非常相似。

source: The request method's semantics might be further specialized by the semantics of some header fields when present in a request (Section 5) if those additional semantics do not conflict with the method.
zh_cn: 如果某些首部字段存在于请求(第 5 节)中，如果这些附加语义不与该方法冲突，那么请求方法的语义可能会进一步专门化。

source: The request methods defined by this specification can be found in Section 4 of [RFC7231], along with information regarding the HTTP method registry and considerations for defining new methods.
zh_cn: 本规范定义的请求方法可以在 [RFC7231] 的第 4 节中找到，以及有关 HTTP 方法注册的信息和定义新方法的注意事项。

source: The request-header fields allow the client to pass additional information about the request, and about the client itself, to the server.
zh_cn: 请求首部字段允许客户端将有关请求以及客户端本身的其他信息传递给服务器。

source: The request-target identifies the target resource upon which to apply the request, as defined in Section 5.3.
zh_cn: 请求目标标识应用请求的目标资源，如第 5.3 节中所定义。

source: The requirement to retry requests under certain circumstances when the server prematurely closes the connection has been removed.
zh_cn: 已删除在服务器过早关闭连接的某些情况下重试请求的要求。

source: The reset takes its sequence number from the ACK field of the incoming segment.
zh_cn: 重置从传入报文段的 ACK 字段获取其序列号。

source: The resource is the conceptual mapping to an entity or set of entities, not necessarily the entity which corresponds to that mapping at any particular instance in time.
zh_cn: 资源是到实体或实体集的概念映射，不一定是在任何特定时刻对应于该映射的实体。

source: The response body, if any, SHOULD also include information about the communication options.
zh_cn: 响应主体(如果有)还应包括有关通信选项的信息。

source: The response header fields allow the server to pass additional information about the response beyond what is placed in the status-line.
zh_cn: 响应首部字段允许服务器传递有关响应的附加信息，这些信息超出了放置在状态行中的内容。

source: The response message will usually contain a representation that explains the status.
zh_cn: 响应消息通常包含解释状态的表示。

source: The response payload, if any, might also describe the communication options in a machine or human-readable representation.
zh_cn: 响应有效载荷(如果有的话)也可以描述机器中的通信选项或人类可读的表示。

source: The response to a GET request is cacheable if and only if it meets the requirements for HTTP caching described in section 13.
zh_cn: 当且仅当它满足第 13 节中描述的 HTTP 缓存要求时，对 GET 请求的响应才是可缓存的。

source: The response to a GET request is cacheable; a cache MAY use it to satisfy subsequent GET and HEAD requests unless otherwise indicated by the Cache-Control header field (Section 5.2 of [RFC7234]).
zh_cn: 对 GET 请求的响应是可缓存的；缓存可以使用它来满足后续的 GET 和 HEAD 请求，除非 Cache-Control 首部字段另有说明([RFC7234] 的第 5.2 节)。

source: The response to a HEAD request MAY be cacheable in the sense that the information contained in the response MAY be used to update a previously cached entity from that resource.
zh_cn: 对于 HEAD 请求的响应可以是可缓存的，因为响应中包含的信息可以用于从该资源更新先前缓存的实体。

source: The response to a HEAD request is cacheable; a cache MAY use it to satisfy subsequent HEAD requests unless otherwise indicated by the Cache-Control header field (Section 5.2 of [RFC7234]).
zh_cn: 对 HEAD 请求的响应是可缓存的；缓存可以使用它来满足后续的 HEAD 请求，除非 Cache-Control 首部字段另有说明([RFC7234] 的第 5.2 节)。

source: The response-header fields allow the server to pass additional information about the response which cannot be placed in the Status-Line.
zh_cn: 响应首部字段允许服务器传递有关响应而无法放入状态行的其他信息。

source: The rest of the handshake uses the same messages as for a 1-RTT handshake with PSK resumption.
zh_cn: 握手的其余部分使用与具有 PSK 恢复的 1-RTT 握手相同的消息。

source: The rest of the response message is to be interpreted in light of the semantics defined for that status code.
zh_cn: 响应消息的其余部分将根据为该状态代码定义的语义进行解释。

source: The result is a protocol that can be used effectively in many different contexts and for which implementations can evolve independently over time.
zh_cn: 结果是一种协议，可以在许多不同的上下文中有效地使用，并且实现可以随着时间的推移独立发展。

source: The resulting PDU is incompatible with many SSLv3 implementations.
zh_cn: 生成的 PDU 与许多 SSLv3 实现不兼容。

source: The results of this unsubscription will cascade back through the chain of operators that applies to the Observable that the observer subscribed to, and this will cause each link in the chain to stop emitting items.
zh_cn: 取消订阅的结果将通过应用于该观察者所订阅的 Observable 的操作符链级联，这将导致链中的每个链接停止发射项目。

source: The return code of the response always notifies the client whether a method is currently allowed on a resource, since the set of allowed methods can change dynamically.
zh_cn: 响应的返回代码始终通知客户端当前是否允许在资源上使用方法，因为允许的方法集可以动态更改。

source: The rightmost domain label of a fully qualified domain name in DNS may be followed by a single "." and should be if it is necessary to distinguish between the complete domain name and some local domain.
zh_cn: DNS 中完全限定域名的最右边的域名标签后面可以跟一个“.”，如果需要区分完整域名和某些本地域，则应该跟一个“.”。

source: The rules for determining the cacheability of HTTP responses are defined in section 13.
zh_cn: 确定 HTTP 响应的可缓存性的规则在第 13 节中定义。

source: The rules for when a message body is allowed in a message differ for requests and responses.
zh_cn: 消息中允许消息主体的规则因请求和响应而异。

source: The rules for when a message-body is allowed in a message differ for requests and responses.
zh_cn: 消息中允许消息主体的规则因请求和响应而异。

source: The same applies to `Observer`, `SingleObserver`, `MaybeObserver` and `CompletableObserver`.
zh_cn: 这同样适用于 `Observer`，`SingleObserver`，`MaybeObserver` 和 `CompletableObserver`。

source: The same limitation exists for the operator `Switch`, which had to be named `switchOnNext`.
zh_cn: 运算符 `Switch` 也存在同样的限制，它必须命名为 `switchOnNext`。

source: The same message type and structure will be used for the client's response to a certificate request message.
zh_cn: 客户端对证书请求消息的响应将使用相同的消息类型和结构。

source: The same program might act as a client on some connections and a server on others.
zh_cn: 同一程序可能在某些连接上充当客户端，在其他连接上充当服务器。

source: The same warnings apply to any use of the early_exporter_master_secret.
zh_cn: 相同的警告适用于 early_exporter_master_secret 的任何使用。

source: The scheme and host are case-insensitive and normally provided in lowercase; all other components are compared in a case-sensitive manner.
zh_cn: 方案和主机不区分大小写，通常以小写形式提供；所有其他组件都以区分大小写的方式进行比较。

source: The scheme and path components are required, though the path may be empty (no characters).
zh_cn: 方案和路径组件是必需的，但路径可能为空(无字符)。

source: The scheme registry maintains the mapping between scheme names and their specifications.
zh_cn: 方案注册表维护方案名称与其规范之间的映射。

source: The second callback takes this state object and provides an output `Observer` whose `onXXX` methods can be called to emit values.
zh_cn: 第二个回调接受这个状态对象，并提供一个输出 `Observer`，可以调用其 `onXXX` 方法来发射值。

source: The second convenience is that most `TestSubscriber`/`TestObserver` methods return the instance itself allowing chaining the various `assertX` methods.
zh_cn: 第二个方便是大多数 `TestSubscriber`/`TestObserver` 方法返回实例本身，允许链式调用各种 `assertX` 方法。

source: The second format is in common use, but is based on the obsolete RFC 850 [12] date format and lacks a four-digit year.
zh_cn: 第二种格式是常用的，但基于过时的 RFC 850 [12] 日期格式，缺少四位数年份。

source: The second is to write the **Hello World** program:
zh_cn: 第二个是编写 ** Hello World ** 程序：

source: The second option is useful if the client only wishes to update the random structures and derived values of a connection, and the third option makes it possible to establish several independent secure connections without repeating the full handshake protocol.
zh_cn: 如果客户端仅希望更新连接的随机结构和派生值，则第二个选项很有用，第三个选项使得可以建立多个独立的安全连接而无需重复完整的握手协议。

source: The second scenario usually involves some asynchronous, callback-based API that has to be converted into an `Flowable`.
zh_cn: 第二种情况通常涉及一些异步的，基于回调的 API，必须将其转换为 `Flowable`。

source: The security parameters for a TLS Connection read and write state are set by providing the following values:
zh_cn: 通过提供以下值来设置 TLS 连接读取和写入状态的安全参数：

source: The security parameters for the pending states can be set by the TLS Handshake Protocol, and the ChangeCipherSpec can selectively make either of the pending states current, in which case the appropriate current state is disposed of and replaced with the pending state; the pending state is then reinitialized to an empty state.
zh_cn: 待处理状态的安全参数可以通过 TLS 握手协议设置，并且 ChangeCipherSpec 可以选择性地使任何一个待处理状态为当前状态，在这种情况下，处理适当的当前状态并用待处理状态替换；然后将挂起状态重新初始化为空状态。

source: The segment + query components of RFC 3986 have been used to define the request-target, instead of abs_path from RFC 1808.
zh_cn: RFC 3986 的段+查询组件已用于定义请求目标，而不是 RFC 1808 中的 abs_path。

source: The segment length (SEG.LEN) includes both data and sequence space occupying controls.
zh_cn: 报文段长度(SEG.LEN)包括数据和控制位占用的序列空间。

source: The selector must be an enumerated type that defines the possible variants the structure defines.
zh_cn: 选择器必须是枚举类型，用于定义结构定义的可能变体。

source: The semantics are that the identified resource is located at the server listening for TCP connections on that port of that host, and the Request-URI for the resource is abs_path (section 5.1.2).
zh_cn: 语义是标识的资源位于服务器上，监听该主机端口上的 TCP 连接，资源的 Request-URI 是 abs_path(第 5.1.2 节)。

source: The semantics of a fragment identifier are defined by the set of representations that might result from a retrieval action on the primary resource.
zh_cn: 片段标识符的语义由可能由主资源上的检索操作产生的表示集定义。

source: The semantics of the GET method change to a "conditional GET" if the request message includes an If-Modified-Since, If-Unmodified-Since, If-Match, If-None-Match, or If-Range header field.
zh_cn: 如果请求消息包括 If-Modified-Since，If-Unmodified-Since，If-Match，If-None-Match 或 If-Range 首部字段，则 GET 方法的语义变为“条件 GET (conditional GET)”。

source: The semantics of the GET method change to a "partial GET" if the request message includes a Range header field.
zh_cn: 如果请求消息包括 Range 首部字段，则 GET 方法的语义变为“部分 GET (partial GET)”。

source: The semantics of the Upgrade header field is now defined in responses other than 101 (this was incorporated from [RFC2817]).
zh_cn: 现在，在不是 101 的响应中定义了升级首部字段的语义(这是从 [RFC2817] 中加入的)。

source: The semantics of this extension are somewhat complicated because the cipher suite indicates permissible signature algorithms but not hash algorithms.
zh_cn: 此扩展的语义有些复杂，因为加密套件表示允许的签名算法，但不表示哈希算法。

source: The semantics of this extension are that the client only supports the use of PSKs with these modes, which restricts both the use of PSKs offered in this ClientHello and those which the server might supply via NewSessionTicket.
zh_cn: 此扩展的语义是客户端仅支持使用这些模式的 PSK，这限制了此 ClientHello 中提供的 PSK 的使用以及服务器可能通过 NewSessionTicket 提供的 PSK。

source: The sender's certificate MUST come first in the list.
zh_cn: 发送者的证书必须在列表中排在第一位。

source: The sender's certificate MUST come in the first CertificateEntry in the list.
zh_cn: 发送者的证书必须位于列表中的第一个 CertificateEntry 中。

source: The sequence number MUST be set to zero whenever a connection state is made the active state.
zh_cn: 当连接状态变为活动状态时，序列号必须设置为零。

source: The sequence number for this record.
zh_cn: 此记录的序列号。

source: The sequence number of the first data octet in this segment (except when SYN is present).
zh_cn: 此报文段中第一个数据八位字节的序列号(存在 SYN 时除外)。

source: The server MAY also send unsolicited extensions in the NewSessionTicket, though the client does not respond directly to these.
zh_cn: 服务器也可以在 NewSessionTicket 中发送未经请求的扩展，但客户端不会直接响应这些扩展。

source: The server MAY send it in the CertificateRequest message.
zh_cn: 服务器可以在 CertificateRequest 消息中发送它。

source: The server MUST NOT process any further requests received on that connection.
zh_cn: 服务器不得处理在该连接上收到的任何进一步请求。

source: The server MUST NOT send a "psk_key_exchange_modes" extension.
zh_cn: 服务器不得发送“psk_key_exchange_modes”扩展。

source: The server MUST send a Certificate message whenever the agreed-upon key exchange method uses certificates for authentication
zh_cn: 只要商定的密钥交换方法使用证书进行身份验证，服务器就必须发送 Certificate 消息

source: The server MUST send a Certificate message whenever the agreed-upon key exchange method uses certificates for authentication (this includes all key exchange methods defined in this document except PSK).
zh_cn: 每当商定的密钥交换方法使用证书进行身份验证时，服务器必须发送 Certificate 消息(这包括本文档中定义的除 PSK 之外的所有密钥交换方法)。

source: The server SHOULD send a "close" connection option in its final response on that connection.
zh_cn: 服务器应该在该连接的最终响应中发送“close”连接选项。

source: The server SHOULD send the same header fields in response to a HEAD request as it would have sent if the request had been a GET, except that the payload header fields (Section 3.3) MAY be omitted.
zh_cn: 服务器在响应 HEAD 请求时，应该发送当请求是 GET 时它将发送的相同的首部字段，除了可以省略有效载荷首部字段(第 3.3 节)。

source: The server can do this by storing the hash of the ClientHello in the HelloRetryRequest cookie (protected with some suitable integrity protection algorithm).
zh_cn: 服务器可以通过将 ClientHello 的哈希值存储在 HelloRetryRequest cookie 中(使用一些合适的完整性保护算法进行保护)来完成此操作。

source: The server may return an empty session_id to indicate that the session will not be cached and therefore cannot be resumed.
zh_cn: 服务器可以返回空的 session_id 以指示会话将不被缓存，因此无法恢复。

source: The server on which a given resource resides or is to be created.
zh_cn: 要在其上创建或将要创建给定资源的服务器。

source: The server processes the ClientHello and determines the appropriate cryptographic parameters for the connection.
zh_cn: 服务器处理 ClientHello 并确定连接的相应加密参数。

source: The server responds with a "pre_shared_key" extension to negotiate the use of PSK key establishment and can (as shown here) respond with a "key_share" extension to do (EC)DHE key establishment, thus providing forward secrecy.
zh_cn: 服务器以“pre_shared_key”扩展来响应以协商 PSK 密钥建立的使用，并且可以(如此处所示)以“key_share”扩展进行响应以进行(EC)DHE 密钥建立，从而提供前向保密。

source: The server responds with a status line, including the message's protocol version and a success or error code, followed by a MIME-like message containing server information, entity metainformation, and possible entity-body content.
zh_cn: 服务器响应，有一行状态行包括消息的协议版本和成功或错误代码，然后是包含服务器信息，实体元信息和可能的实体主体内容的类似 MIME 的消息。

source: The server sends extension requests in the CertificateRequest message which a client MAY respond to with a Certificate message.
zh_cn: 服务器在 CertificateRequest 消息中发送扩展请求，客户端可以使用 Certificate 消息来响应该消息。

source: The server then checks its session cache for a match.
zh_cn: 然后，服务器检查其会话缓存是否匹配。

source: The server then continues to read from the connection until it receives a corresponding close by the client, or until the server is reasonably certain that its own TCP stack has received the client's acknowledgement of the packet(s) containing the server's last response.
zh_cn: 然后，服务器继续从连接读取，直到它收到客户端的相应关闭，或者直到服务器合理地确定其自己的 TCP 堆栈已经收到客户端对包含服务器最后响应的数据包的确认。

source: The server then ignores early data by skipping all records with an external content type of "application_data" (indicating that they are encrypted), up to the configured max_early_data_size.
zh_cn: 然后，服务器通过跳过具有外部内容类型“application_data”(表示它们已加密)的所有记录来忽略早期数据，直到配置的 max_early_data_size。

source: The server then sends two messages to establish the Server Parameters:
zh_cn: 然后，服务器发送两条消息以建立服务器参数：

source: The server then skips past early data by attempting to deprotect received records using the handshake traffic key, discarding records which fail deprotection (up to the configured max_early_data_size).
zh_cn: 然后，服务器尝试使用握手通信密钥对接收的记录进行去保护，丢弃过去保护失败的记录(直到配置的 max_early_data_size)，从而跳过早期数据。

source: The server uses its private key to decrypt the pre_master_secret.
zh_cn: 服务器使用自己的私钥解密 pre_master_secret。

source: The server will select a cipher suite or, if no acceptable choices are presented, return a handshake failure alert and close the connection.
zh_cn: 服务器将选择加密套件，或者，如果没有可接受的选择，则返回握手失败警报并关闭连接。

source: The server will send this message in response to a ClientHello message if it is able to find an acceptable set of parameters but the ClientHello does not contain sufficient information to proceed with the handshake.
zh_cn: 如果客户端能够找到一组可接受的参数但 ClientHello 不包含足够的信息来继续握手，则服务器将发送此消息以响应 ClientHello 消息。

source: The server will send this message in response to a ClientHello message to proceed with the handshake if it is able to negotiate an acceptable set of handshake parameters based on the ClientHello.
zh_cn: 如果能够根据 ClientHello 协商一组可接受的握手参数，则服务器将发送此消息以响应 ClientHello 消息以继续握手。

source: The server will send this message in response to a ClientHello message when it was able to find an acceptable set of algorithms.
zh_cn: 当服务器能够找到一组可接受的算法时，它将发送此消息以响应 ClientHello 消息。

source: The server will then wait for a client response.
zh_cn: 然后，服务器将等待客户端响应。

source: The server's Diffie-Hellman public value (g^X mod p).
zh_cn: 服务器的 Diffie-Hellman 公共值(g^X mod p)。

source: The server's certificate_list MUST always be non-empty.
zh_cn: 服务器的 certificate_list 必须始终为非空。

source: The server's extensions MUST contain "supported_versions".
zh_cn: 服务器的扩展必须包含“supported_versions”。

source: The server's key exchange parameters.
zh_cn: 服务器的密钥交换参数。

source: The session identifier MAY be from an earlier connection, this connection, or from another currently active connection.
zh_cn: 会话标识符可以来自较早的连接，此连接，也可以来自另一个当前活动的连接。

source: The set of common methods for HTTP/1.1 is defined below.
zh_cn: HTTP/1.1 的常用方法集定义如下。

source: The set of methods allowed by a target resource can be listed in an Allow header field (Section 7.4.1).
zh_cn: 目标资源允许的方法集可以列在 Allow 首部字段中(第 7.4.1 节)。

source: The signature is a digital signature using that algorithm.
zh_cn: signature 是使用该算法的数字签名。

source: The signature is a digital signature using those algorithms over the contents of the element.
zh_cn: 签名是在元素的内容上使用这些算法的数字签名。

source: The signature is represented as a DER-encoded [X690] ECDSA-Sig-Value structure.
zh_cn: 签名表示为 DER 编码的 [X690] ECDSA-Sig-Value 结构。

source: The signatures on certificates that are self-signed or certificates that are trust anchors are not validated, since they begin a certification path (see [RFC5280], Section 3.2).
zh_cn: 自签名证书上的签名或信任锚证书的签名未经验证，因为它们开始了证书路径(参见 [RFC5280]，第 3.2 节)。

source: The simplest three-way handshake is shown in figure 7 below.
zh_cn: 最简单的三次握手如下图 7 所示。

source: The single cipher suite selected by the server from the list in ClientHello.cipher_suites.
zh_cn: 服务器从 ClientHello.cipher_suites 中的列表中选择的单个加密套件。

source: The single compression algorithm selected by the server from the list in ClientHello.compression_methods.
zh_cn: 服务器从 ClientHello.compression_methods 中的列表中选择的单个压缩算法。

source: The single octet shall have bit 8 set to one, and bits 7 to 1 set to zero.
zh_cn: 单个八位字节应将第 8 位设置为 1，将第 7 位设置为 0。

source: The size of the vector may be specified at documentation time or left unspecified until runtime.
zh_cn: vector 的大小可以在文档时指定，或者在运行时之前不指定。

source: The source port number.
zh_cn: 源端口号。

source: The special anyExtendedKeyUsage OID MUST NOT be used in the request.
zh_cn: 必须在请求中使用特殊的 anyExtendedKeyUsage OID。

source: The specification has been written with this in mind, and it is intended to reflect the needs of those two groups.
zh_cn: 本说明书的编写考虑到了这一点，旨在反映这两个群体的需求。

source: The specification itself has evolved out of RxJava 1.x and provides a common baseline for reactive systems and libraries.
zh_cn: 规范本身已经从 RxJava 1.x 发展而来，并为响应式系统和库提供了一个共同的基线。

source: The specification of URI is designed to meet the recommendations laid out in "Functional Recommendations for Internet Resource Locators" [RFC1736] and "Functional Requirements for Uniform Resource Names" [RFC1737].
zh_cn: URI 的规范旨在满足“互联网资源定位器的功能建议”[RFC1736] 和“统一资源名称的功能要求”[RFC1737] 中列出的建议。

source: The specified PSK authentication is not a strong password-based authenticated key exchange even when used with Diffie-Hellman key establishment.
zh_cn: 即使与 Diffie-Hellman 密钥建立一起使用，指定的 PSK 身份验证也不是基于密码的强身份验证密钥交换。

source: The state diagram in figure 6 illustrates only state changes, together with the causing events and resulting actions, but addresses neither error conditions nor actions which are not connected with state changes.
zh_cn: 图 6 中的状态图仅说明状态变化以及导致事件和结果动作，但既不解决错误条件也不解决与状态变化无关的动作。

source: The states are: LISTEN, SYN-SENT, SYN-RECEIVED, ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, LAST-ACK, TIME-WAIT, and the fictional state CLOSED.
zh_cn: 状态是：LISTEN, SYN-SENT, SYN-RECEIVED, ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, LAST-ACK, TIME-WAIT, 和虚构状态 CLOSED.

source: The status codes listed below are defined in this specification, Section 4 of [RFC7232], Section 4 of [RFC7233], and Section 3 of [RFC7235].
zh_cn: 下面列出的状态代码在本规范，[RFC7232] 的第 4 节，[RFC7233] 的第 4 节和 [RFC7235] 的第 3 节中定义。

source: The status-code element is a 3-digit integer code describing the result of the server's attempt to understand and satisfy the client's corresponding request.
zh_cn: status-code 元素是一个 3 位整数代码，用于描述服务器尝试理解和满足客户端相应请求的结果。

source: The status-code element is a three-digit integer code giving the result of the attempt to understand and satisfy the request.
zh_cn: 状态代码元素是一个三位整数代码，给出了试图理解和满足请求的结果。

source: The stream cipher encrypts the entire block, including the MAC.
zh_cn: 流加密加密整个块，包括 MAC。

source: The subsequent octets shall encode the number of the tag as follows:
zh_cn: 随后的八位字节应编码标签的编号，如下所示：

source: The symbol "=<" means "less than or equal" (modulo 2**32).
zh_cn: 符号 "=<" 表示“小于或等于”(模 2**32)。

source: The synchronization requires each side to send it's own initial sequence number and to receive a confirmation of it in acknowledgment from the other side.
zh_cn: 同步要求每一方发送它自己的初始序列号，并从另一方接收确认信息。

source: The syntax and registry of HTTP language tags is the same as that defined by RFC 1766 [1].
zh_cn: HTTP 语言标记的语法和注册与 RFC 1766 [1] 定义的相同。

source: The syntax draws from several sources in its structure.
zh_cn: 语法从其结构中的几个来源中提取。
